app/Controllers/SiteController.php

    public function index()
    {
        $jobs = new VagaModel();
        $alljobs = $jobs->orderBy('created_at', 'DESC')
                           ->limit(4)
                           ->findAll();
---
SELECT *
FROM `vagas`
WHERE `vagas`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 4

    public function todasVagas(){
        $jobModel = new VagaModel();
    $totalJobs = $jobModel->countAllResults();
    $data = [
        'jobs' => $jobModel->orderBy('created_at', 'DESC')
                         ->paginate(7), // 5 itens por página
        'pager' => $jobModel->pager,
        'totalJobs' => $totalJobs
    ];
---
SELECT COUNT(*) AS `numrows`
FROM `vagas`
WHERE `vagas`.`deleted_at` IS NULL
SELECT *
FROM `vagas`
WHERE `vagas`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 14, 7